[M_TempleSlaughter1 MissionDefinition]
TurnInDescription="That was nothin'. Are you ready for round two?"
MissionSummary="Survive the Magic Slaughter's first round."

[M_TempleSlaughter1:SurvivetheRound MissionObjectiveDefinition]
ProgressMessage="Survive round one"

[M_TempleSlaughter2 MissionDefinition]
MissionDescription="Welcome to the Magic Slaughter! Your host, Murderlin The Wizard, has asked you to prepare yourself for five rounds of magic, traps, and intense brutality. If you can survive all five rounds, you shall be remembered forever!<br>You may have completed the first round, but the second will unleash all kinds of new horrors upon you. Better be prepared."
MissionSummary="Survive the Magic Slaughter's second round."

[M_TempleSlaughter2:SurvivetheRound MissionObjectiveDefinition]
ProgressMessage="Survive round two"

[M_TempleSlaughter3 MissionDefinition]
MissionDescription="Welcome to the Magic Slaughter! Your host, Murderlin The Wizard, has asked you to prepare yourself for five rounds of magic, traps, and intense brutality. If you can survive all five rounds, you shall be remembered forever!<br>You have successfully made it to the third round. Good luck!"
MissionSummary="Survive the Magic Slaughter's third round."

[M_TempleSlaughter3:SurvivetheRound MissionObjectiveDefinition]
ProgressMessage="Survive round three"

[M_TempleSlaughter4 MissionDefinition]
MissionDescription="Welcome to the Magic Slaughter! Your host, Murderlin The Wizard, has asked you to prepare yourself for five rounds of magic, traps, and intense brutality. If you can survive all five rounds, you shall be remembered forever!<br>You have successfully made it to the second-to-last round. Good luck!"
MissionSummary="Survive the Magic Slaughter's fourth round."

[M_TempleSlaughter4:SurvivetheRound MissionObjectiveDefinition]
ProgressMessage="Survive round four"

[M_TempleSlaughter5 MissionDefinition]
MissionDescription="Welcome to the Magic Slaughter! Your host, Murderlin The Wizard, has asked you to prepare yourself for five rounds of magic, traps, and intense brutality. If you can survive all five rounds, you shall be remembered forever!<br>You have successfully made it to the final and most difficult round. Good luck!"
TurnInDescription="You've done it! You now have the option of trying the repeatable badass round!"
MissionSummary="Survive the Magic Slaughter's final round."

[M_TempleSlaughter5:SurvivetheRound MissionObjectiveDefinition]
ProgressMessage="Survive round five"

[M_TempleSlaughter6Badass:SurvivetheRound MissionObjectiveDefinition]
ProgressMessage="Survive round six"

[M_TempleSlaughterIntro MissionDefinition]
MissionDescription="Moxxi -- who, as you may remember, owns several Circles of Slaughter throughout Pandora -- has set up a magic-themed arena somewhere in Tina's fantasy world. If you can find Murderlin the Wizard, he will help you fight your way through a few rounds of fantastical violence."
